#复制和调用

#当调用和操作数组时,它们的数据有时会被复制进一个新的数列,有时不会.这对于初学者经常是个麻烦.

import numpy as np

#简单的赋值不会创建对象的拷贝或者数据

a=np.array(
    [[0,1,2,3],
    [4,5,6,7],
    [8,9,10,11]])

d=a.copy()

print(d is a) #d和a本质上无关
# False
print(d.base is a)
# False


d[0,0]=9999 #对d的修改不影响a
print(a)
# [[ 0  1  2  3]
#  [ 4  5  6  7]
#  [ 8  9 10 11]]

# 有时候会在切片后调用复制,如果原数组不在被需要的话.比如,a是一个很大的中间处理环节的结果,而最为最终结果的b只是a的很小一部分,
# 那么就会在切片创建b时使用深复制

a=np.arange(int(1e8))
b=a[:100].copy()
del a
print(b)
# [ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
#  24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47
#  48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71
#  72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95
#  96 97 98 99]



